Revit 2027 API
ExclusionFilter Constructor
 Constructs a new instance of a filter to exclude elements automatically.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExclusionFilter(
	ICollection<ElementId> idsToExclude
)
Public Sub New (
	idsToExclude As ICollection(Of ElementId)
)
public:
ExclusionFilter(
	ICollection<ElementId^>^ idsToExclude
)
new :
        idsToExclude : ICollection<ElementId> -> ExclusionFilter
Parameters
idsToExclude ICollection<ElementId>
 The ids to exclude from the results.
Exceptions
Exception | Condition
ArgumentException |  The input collection of ids was empty, or its contents were not valid for iteration.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ExclusionFilter Class
Autodesk.Revit.DB Namespace